Repository: CubicMaldo/RootPath-Game
Catalog: src/clippy/clippy_locales/*.po
Languages: es

# CLIPPY_ERROR_INVALID_EVENT
source: I received an invalid event. Please check the event configuration.
es: Recibí un evento inválido. Por favor verifica la configuración del evento.

# CLIPPY_ERROR_WRONG_ANSWER
source: That's not quite right. Review the information carefully and try again.
es: No es del todo correcto. Revisa la información cuidadosamente e intenta nuevamente.

# CLIPPY_ERROR_TIMEOUT
source: Time's up! Don't worry, you can try again.
es: ¡Se acabó el tiempo! No te preocupes, puedes intentarlo de nuevo.

# CLIPPY_ERROR_INVALID_INPUT
source: That input doesn't look valid. Check the required format and try again.
es: Esa entrada no parece válida. Verifica el formato requerido e intenta de nuevo.

# CLIPPY_ERROR_GENERIC
source: Something went wrong. Take a moment to review the challenge.
es: Algo salió mal. Tómate un momento para revisar el desafío.

# CLIPPY_ERROR_HINT_SUGGESTION
source: Need help? Try using the hint button for guidance.
es: ¿Necesitas ayuda? Intenta usar el botón de pista para obtener orientación.

# CLIPPY_TUTORIAL_START
source: Welcome! Let me show you the basics:
es: ¡Bienvenido! Déjame mostrarte lo básico:

# CLIPPY_TUTORIAL_GENERIC
source: Follow the on-screen instructions to get started.
es: Sigue las instrucciones en pantalla para comenzar.

# CLIPPY_MINIGAME_START
source: Starting {game} challenge!
es: ¡Iniciando desafío de {game}!

# CLIPPY_MINIGAME_GENERIC
source: Time to test your {game} skills. Good luck!
es: Es hora de probar tus habilidades en {game}. ¡Buena suerte!

# CLIPPY_PROGRESS_HIGH
source: Excellent progress! You're almost at the goal.
es: ¡Excelente progreso! Casi llegas a la meta.

# CLIPPY_PROGRESS_MID
source: You're halfway there! Keep up the good work.
es: ¡Vas a la mitad! Sigue con el buen trabajo.

# CLIPPY_PROGRESS_LOW
source: Nice start! Keep exploring to make more progress.
es: ¡Buen comienzo! Continúa explorando para avanzar más.

# CLIPPY_ACHIEVEMENT
source: Achievement unlocked: {achievement}! Great job!
es: ¡Logro desbloqueado: {achievement}! ¡Excelente trabajo!

# CLIPPY_NODE_ENTERED
source: You've reached node: {node}
es: Has alcanzado el nodo: {node}

# CLIPPY_HINT_GENERIC
source: Think carefully about the information presented. Look for patterns and unusual details.
es: Piensa cuidadosamente sobre la información presentada. Busca patrones y detalles inusuales.

# CLIPPY_GAME_COMPLETED
source: Congratulations! You've completed the game. Excellent work on mastering these cybersecurity concepts!
es: ¡Felicitaciones! Has completado el juego. ¡Excelente trabajo dominando estos conceptos de ciberseguridad!
